example/example-file.tex.tex
% Created 2026-05-05 Tue 23:54
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{mzimmermann}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={mzimmermann},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Introduction}
\label{sec:orgc62cd38}

This is a simple org file, containing asciimath.
\subsection{Problem}
\label{sec:org7a7870a}

Org does not have a direct method to export this file to PDF (because ascimath is there literally).
\subsection{Solution}
\label{sec:org96be3ec}

I wrote a script \texttt{convert-asciimath-in-org-to-tex.sh} which converts the contained asciimath snippets to tex, saves this file with extension \texttt{.tex.org}, then exports to tex and/or pdf. 

Then we can use regular org-export-to-pdf to convert the org file to PDF with latex.
\subsection{Formatting asciimath}
\label{sec:org3573c59}

\textbf{For the conversion and export to work, the asciimath text must be in backquotes.}

Take care of proper backquotes ending, although missing them does not cause any damage apart from incorrect export.
\section{Some asciimath examples}
\label{sec:orgfe5cfdc}

This file is testing the process on some math formulas examples


This line should be a tex paragraph.


Asciimath Ex1: Single line matrix in asciimath

\(M = \left ( \begin{matrix} 1 & 2 \\ 3 & 4 \end{matrix} \right )\)

Asciimath Ex2: Single line subset asciimath

\(A \subseteq B\)

Asciimath Ex3: Inline \(A \subseteq B\) from "Inline" to here it should be one line.

Asciimath Ex4: Multi line matrix in asciimath 1:

\(M = \left ( \begin{matrix} 1 & 2 \\ 3 & 4 \end{matrix} \right )\)


Asciimath Ex5: The line below contains Tex matrix, formatted for readability in \texttt{.tex} file:

$$M = \left ( \begin{matrix}
1.1 & 2.2 \\
3.3 & 4.4 \\
5.5 & 6.6
\end{matrix} \right )$$


end of org file testing 'emacs-org-asciimath2tex'
\end{document}
